In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

In [11]:
xls = pd.ExcelFile('KPMG_VI_New_raw_data_update_final_Iter1.xlsx')
pd1 = pd.read_excel(xls, sheet_name=1)

In [12]:
df = pd.DataFrame(pd1)

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 13 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          4000 non-null   int64
 1   first_name                           4000 non-null   object
 2   last_name                            3875 non-null   object
 3   gender                               4000 non-null   object
 4   past_3_years_bike_related_purchases  4000 non-null   int64
 5   DOB                                  3913 non-null   datetime64[ns]
 6   job_title                            3494 non-null   object
 7   job_industry_category                3344 non-null   object
 8   wealth_segment                       4000 non-null   object
 9   deceased_indicator                   4000 non-null   object
 10  default                              3698 non-null   object
 11  owns_car                             4000 non-null   object
 12  tenure                               3913 non-null   float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(9)
memory usage: 406.4+ KB

In [14]:
df.describe()

       customer_id  past_3_years_bike_related_purchases       tenure
count  4000.000000                          4000.000000  3913.000000
mean   2000.500000                            48.890000    10.657041
std    1154.844867                            28.715005     5.660146
min       1.000000                             0.000000     1.000000
25%    1000.750000                            24.000000     6.000000
50%    2000.500000                            48.000000    11.000000
75%    3000.250000                            73.000000    15.000000
max    4000.000000                            99.000000    22.000000

In [15]:
#Check First 5 records
df.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
0,34,Jephthah,Bachmann,U,59,1843-12-21,Legal Assistant,IT,Affluent Customer,N,NaN,No,20.0
1,66,Anselm,Gawne,Male,46,2002-03-11,Account Executive,Argiculture,High Net Worth,N,ï½ï½¨(Â´âï½â©,No,1.0
2,1888,Sibyl,Scholtz,Female,67,2002-01-26,Food Chemist,Health,Mass Customer,N,NaN,Yes,1.0
3,3435,Stevena,Allcock,Female,80,2002-01-15,Senior Editor,NaN,Affluent Customer,N,ÅâÂ´â°ËÃÂ¨ËÃâââ,No,1.0
4,2858,Benedicto,Radki,Male,4,2002-01-09,Recruiting Manager,NaN,Mass Customer,N,testâ testâ«,Yes,1.0

In [17]:
#Check for null values
df.isnull().sum()

customer_id                              0
first_name                               0
last_name                              125
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     87
job_title                              506
job_industry_category                  656
wealth_segment                           0
deceased_indicator                       0
default                                302
owns_car                                 0
tenure                                  87
dtype: int64

In [18]:
df.shape

(4000, 13)

In [19]:
#Dropping the col if too many too many missing data points

drop_threshold = df.shape[0]*0.5
df = df.dropna(thresh=drop_threshold, how='all', axis='columns').copy()

In [21]:
column_names = df.columns

for i in column_names:
    print((i, df[i].is_unique))

('customer_id', True)
('first_name', False)
('last_name', False)
('gender', False)
('past_3_years_bike_related_purchases', False)
('DOB', False)
('job_title', False)
('job_industry_category', False)
('wealth_segment', False)
('deceased_indicator', False)
('default', False)
('owns_car', False)
('tenure', False)

In [24]:
#Deleting column with irrelevant data

del df['default']

In [26]:
#Checking ID column

df['customer_id'] = df['customer_id'].astype('int64')

In [27]:
#Making Gender as category

df['gender'] = df['gender'].astype('category')

In [28]:
#Checking Gender
df['gender'].value_counts()

Female    2037
Male      1872
U           88
F            1
Femal        1
M            1
Name: gender, dtype: int64

In [29]:
#Rectifying

df['gender'].replace({'M':'Male','F': 'Female', 'Femal': 'Female'}, inplace= True)

In [30]:
df.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure
0,34,Jephthah,Bachmann,U,59,1843-12-21,Legal Assistant,IT,Affluent Customer,N,No,20.0
1,66,Anselm,Gawne,Male,46,2002-03-11,Account Executive,Argiculture,High Net Worth,N,No,1.0
2,1888,Sibyl,Scholtz,Female,67,2002-01-26,Food Chemist,Health,Mass Customer,N,Yes,1.0
3,3435,Stevena,Allcock,Female,80,2002-01-15,Senior Editor,NaN,Affluent Customer,N,No,1.0
4,2858,Benedicto,Radki,Male,4,2002-01-09,Recruiting Manager,NaN,Mass Customer,N,Yes,1.0

In [31]:
#Job Title

df['job_title'].value_counts()

Business Systems Development Analyst    45
Social Worker                           44
Tax Accountant                          44
Internal Auditor                        42
Recruiting Manager                      41
                                        ..
Systems Administrator IV                 4
Health Coach III                         3
Research Assistant III                   3
Health Coach I                           3
Developer I                              1
Name: job_title, Length: 195, dtype: int64

In [32]:
#Filling using back filling
df['job_title'] = df['job_title'].fillna(method='bfill')

In [33]:
#Job Ind Cat
df['job_industry_category'].value_counts()

Manufacturing         799
Financial Services    774
Health                602
Retail                358
Property              267
IT                    223
Entertainment         136
Argiculture           113
Telecommunications     72
Name: job_industry_category, dtype: int64

In [34]:
#Filling using forward filling

df['job_industry_category'] = df['job_industry_category'].fillna(method='ffill')

In [35]:
#DOB column

df['DOB'] = df['DOB'].dt.date

In [36]:
#df.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure
0,34,Jephthah,Bachmann,U,59,1843-12-21,Legal Assistant,IT,Affluent Customer,N,No,20.0
1,66,Anselm,Gawne,Male,46,2002-03-11,Account Executive,Argiculture,High Net Worth,N,No,1.0
2,1888,Sibyl,Scholtz,Female,67,2002-01-26,Food Chemist,Health,Mass Customer,N,Yes,1.0
3,3435,Stevena,Allcock,Female,80,2002-01-15,Senior Editor,Health,Affluent Customer,N,No,1.0
4,2858,Benedicto,Radki,Male,4,2002-01-09,Recruiting Manager,Health,Mass Customer,N,Yes,1.0

In [37]:
#Changing to Boolean : deceased_indicator

f = {'N': False, 'Y': True}
df['deceased_indicator'] = df['deceased_indicator'].map(f).fillna(df['deceased_indicator'])

In [38]:
#Own car change to Boolean

g = {'No': False, 'Yes': True}
df['owns_car'] = df['owns_car'].map(g).fillna(df['owns_car'])

In [40]:
import numpy as np

np.nanmedian(df['tenure'])

11.0

In [41]:
df['tenure'].fillna(value= 11.0, inplace = True)

In [42]:
df.columns

Index(['customer_id', 'first_name', 'last_name', 'gender',
       'past_3_years_bike_related_purchases', 'DOB', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'owns_car', 'tenure'],
      dtype='object')

In [43]:
df.columns = map(str.lower, df.columns)

In [44]:
df.columns

Index(['customer_id', 'first_name', 'last_name', 'gender',
       'past_3_years_bike_related_purchases', 'dob', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'owns_car', 'tenure'],
      dtype='object')

In [45]:
df.columns = map(str.strip, df.columns)

In [46]:
df.columns

Index(['customer_id', 'first_name', 'last_name', 'gender',
       'past_3_years_bike_related_purchases', 'dob', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'owns_car', 'tenure'],
      dtype='object')

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 12 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          4000 non-null   int64
 1   first_name                           4000 non-null   object
 2   last_name                            3875 non-null   object
 3   gender                               4000 non-null   object
 4   past_3_years_bike_related_purchases  4000 non-null   int64
 5   dob                                  3913 non-null   object
 6   job_title                            4000 non-null   object
 7   job_industry_category                4000 non-null   object
 8   wealth_segment                       4000 non-null   object
 9   deceased_indicator                   4000 non-null   bool
 10  owns_car                             4000 non-null   bool
 11  tenure                               4000 non-null   float64
dtypes: bool(2), float64(1), int64(2), object(7)
memory usage: 320.4+ KB

In [49]:
df

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,dob,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure
0,34,Jephthah,Bachmann,U,59,1843-12-21,Legal Assistant,IT,Affluent Customer,False,False,20.0
1,66,Anselm,Gawne,Male,46,2002-03-11,Account Executive,Argiculture,High Net Worth,False,False,1.0
2,1888,Sibyl,Scholtz,Female,67,2002-01-26,Food Chemist,Health,Mass Customer,False,True,1.0
3,3435,Stevena,Allcock,Female,80,2002-01-15,Senior Editor,Health,Affluent Customer,False,False,1.0
4,2858,Benedicto,Radki,Male,4,2002-01-09,Recruiting Manager,Health,Mass Customer,False,True,1.0
...,...,...,...,...,...,...,...,...,...,...,...,...
3995,3779,Ulick,Daspar,U,68,NaT,Legal Assistant,IT,Affluent Customer,False,False,11.0
3996,3883,Nissa,Conrad,U,35,NaT,Legal Assistant,IT,Mass Customer,False,False,11.0
3997,3931,Kylie,Epine,U,19,NaT,Assistant Manager,IT,High Net Worth,False,True,11.0
3998,3935,Teodor,Alfonsini,U,72,NaT,Assistant Manager,IT,High Net Worth,False,True,11.0
3999,3998,Sarene,Woolley,U,60,NaT,Assistant Manager,IT,High Net Worth,False,False,11.0

In [51]:
#Saving cleaned file

df.to_csv('./Data1_CustomerDemographic_cleaned.csv', index= False)